tutorials/OF-RTM/Bruschke/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compressibleFiberPorousInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

fullValue	    0.9999;

endTime         10;

deltaT          0.0000001;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo		0.5;
maxAlphaCo	0.3;

maxDeltaT	1;

libs 	(
		"libsampling.so"			
		"libgroovyBC.so"
		);
// ************************************************************************* //
functions
{
	
}

