tutorials/OF-RTM/Bruschke/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0.05 0 0)
    (1 0 0)
    (2 0 0)
    (2 0.707107 0)
    (0.707107 0.707107 0)
    (0.0353553 0.0353553 0)
    (2 2 0)
    (0.707107 2 0)
    (0 2 0)
    (0 1 0)
    (0 0.05 0) //10
    (0.05 0 0.05)
    (1 0 0.05)
    (2 0 0.05)
    (2 0.707107 0.05)
    (0.707107 0.707107 0.05)
    (0.0353553 0.0353553 0.05)
    (2 2 0.05)
    (0.707107 2 0.05)
    (0 2 0.05)
    (0 1 0.05)
    (0 0.05 0.05)
	
	(-0.05 0 0) //22
    (-1 0 0)
    (-2 0 0)
    (-2 -0.707107 0)
    (-0.707107 -0.707107 0)
    (-0.0353553 -0.0353553 0)
    (-2 -2 0)
    (-0.707107 -2 0)
    (0 -2 0)
    (0 -1 0)
    (0 -0.05 0)
    (-0.05 0 0.05)
    (-1 0 0.05)
    (-2 0 0.05)
    (-2 -0.707107 0.05)
    (-0.707107 -0.707107 0.05)
    (-0.0353553 -0.0353553 0.05)
    (-2 -2 0.05)
    (-0.707107 -2 0.05)
    (0 -2 0.05)
    (0 -1 0.05)
    (0 -0.05 0.05)
	
	(-2 0.707107 0)	//44 (3)
    (-0.707107 0.707107 0)
    (-0.0353553 0.0353553 0)
    (-2 2 0)
    (-0.707107 2 0)
	
	(2 -0.707107 0) //49
    (0.707107 -0.707107 0)
    (0.0353553 -0.0353553 0)
    (2 -2 0)
    (0.707107 -2 0)
	
	(-2 0.707107 0.05)	//54 (3)
    (-0.707107 0.707107 0.05)
    (-0.0353553 0.0353553 0.05)
    (-2 2 0.05)
    (-0.707107 2 0.05)
	
	(2 -0.707107 0.05) //59
    (0.707107 -0.707107 0.05)
    (0.0353553 -0.0353553 0.05)
    (2 -2 0.05)
    (0.707107 -2 0.05)
);

blocks
(

    hex (5 4 9 10 16 15 20 21) (20 10 3) simpleGrading (1 1 1)
    hex (0 1 4 5 11 12 15 16) (20 10 3) simpleGrading (1 1 1)
    hex (1 2 3 4 12 13 14 15) (20 10 3) simpleGrading (1 1 1)
    hex (4 3 6 7 15 14 17 18) (20 20 3) simpleGrading (1 1 1)
    hex (9 4 7 8 20 15 18 19) (10 20 3) simpleGrading (1 1 1)
	
	hex (27 26 31 32 38 37 42 43) (20 10 3) simpleGrading (1 1 1)
    hex (22 23 26 27 33 34 37 38) (20 10 3) simpleGrading (1 1 1)
    hex (23 24 25 26 34 35 36 37) (20 10 3) simpleGrading (1 1 1)
    hex (26 25 28 29 37 36 39 40) (20 20 3) simpleGrading (1 1 1)
    hex (31 26 29 30 42 37 40 41) (10 20 3) simpleGrading (1 1 1)
	
	hex (45 46 10 9 55 56 21 20) (20 10 3) simpleGrading (1 1 1) 	//0
	hex (9 8 48 45 20 19 58 55) (20 10 3) simpleGrading (1 1 1)		//4
	hex (45 48 47 44 55 58 57 54) (20 20 3) simpleGrading (1 1 1)	//3
	
	hex (51 50 1 0 61 60 12 11) (20 10 3) simpleGrading (1 1 1) 	//1
	hex (2 1 50 49 13 12 60 59) (20 10 3) simpleGrading (1 1 1)		//2
	hex (50 53 52 49 60 63 62 59) (20 20 3) simpleGrading (1 1 1)	//3
	
	hex (46 45 23 22 56 55 34 33) (20 10 3) simpleGrading (1 1 1) 	//0
	hex (24 23 45 44 35 34 55 54) (20 10 3) simpleGrading (1 1 1)	//4
		
	hex (50 51 32 31 60 61 43 42) (20 10 3) simpleGrading (1 1 1) 	//1
	hex (31 30 53 50 42 41 63 60) (20 10 3) simpleGrading (1 1 1)	//2
	
	
	
	
);

edges
(

    arc 0 5 (0.0469846 0.017101 0)
    arc 5 10 (0.017101 0.0469846 0)
    arc 1 4 (0.939693 0.34202 0)
    arc 4 9 (0.34202 0.939693 0)
    arc 11 16 (0.0469846 0.017101 0.05)
    arc 16 21 (0.017101 0.0469846 0.05)
    arc 12 15 (0.939693 0.34202 0.05)
    arc 15 20 (0.34202 0.939693 0.05)
	
	arc 22 27 (-0.0469846 -0.017101 0)
    arc 27 32 (-0.017101 -0.0469846 0)
    arc 23 26 (-0.939693 -0.34202 0)
    arc 26 31 (-0.34202 -0.939693 0)
    arc 33 38 (-0.0469846 -0.017101 0.05)
    arc 38 43 (-0.017101 -0.0469846 0.05)
    arc 34 37 (-0.939693 -0.34202 0.05)
    arc 37 42 (-0.34202 -0.939693 0.05)
	
	arc 0 51 (0.0469846 -0.017101 0)
	arc 11 61 (0.0469846 -0.017101 0.05)
	arc 1 50 (0.939693 -0.34202 0)
    arc 12 60 (0.34202 -0.939693 0.05)
	
    arc 46 10 (-0.017101 0.0469846 0)    
	arc 56 21 (-0.017101 0.0469846 0.05)
	arc 9 45 (-0.939693 0.34202 0)
    arc 20 55 (-0.34202 0.939693 0.05)
	
	arc 32 51 (0.0469846 -0.017101 0)
	arc 43 61 (0.0469846 -0.017101 0.05)
	arc 31 50 (0.939693 -0.34202 0)
    arc 42 60 (0.34202 -0.939693 0.05)
	
    arc 22 46 (-0.017101 0.0469846 0)    
	arc 33 56 (-0.017101 0.0469846 0.05)
	arc 23 45 (-0.939693 0.34202 0)
    arc 34 55 (-0.34202 0.939693 0.05)
	
	
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 5 16 11)
			(5 10 21 16) 
			(22 27 38 33)
			(27 32 43 38) 
			(0 51 61 11)
			(10 46 56 21)
			(32 51 61 43)
			(22 46 56 33)
        );
    }
	outlet
    {
        type patch;
        faces
        (
            (2 3 14 13)
			(3 6 17 14)
			(6 7 18 17)
			(7 8 19 18)
			
			(24 25 36 35)
			(25 28 39 36)
			(28 29 40 39)
			(29 30 41 40)
			
			(8 48 58 19)
			(48 47 57 58)
			(47 44 54 57)
			(44 24 54 35)
			
			(2 49 59 13)
			(49 52 62 59)
			(52 53 63 62)
			(53 30 41 63)
			
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
