tutorials/OF-RTM/Bruschke/constant/fiberPorousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fiberPorousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    layer1
    {		
    useLocalFiberVolumeFraction true;
	useInterpolation true;
		
		//SMiLE Zoltek UD 300 ohne Binder
//		MeasuredData
//		{
			//type: exponential, linear, spline
//			type exponential;
//			FVG (0.333 0.375 0.4166 0.458 0.5 0.583);			
//			K1 (1.292e-8 9.47518e-9 5.09912e-9 1.64282e-10 4.338e-11 8.06588e-12);
//			K2 (2.10953e-10 7.42198e-11 3.56498e-11 1.79797e-11 7.39315e-12 7.93073e-13);
//			K3 (2.10953e-10 7.42198e-11 3.56498e-11 1.79797e-11 7.39315e-12 7.93073e-13);
//		}
		
		//TEST CRTM
		MeasuredData
		{
			//type: exponential, linear, spline
			type spline;
			FVG (0.3333 0.338983051 0.344827586 0.350877193 0.357142857 0.363636364 0.37037037 0.377358491 0.384615385 0.392156863 0.4 0.408163265 0.416666667 0.425531915 0.434782609 0.444444444 0.454545455 0.465116279 0.476190476 0.487804878 0.5);			
			K1 (1.45136E-10 1.36753E-10 1.28682E-10 1.20872E-10 1.13322E-10 1.06032E-10 9.90005E-11 9.22275E-11 8.57119E-11 7.94528E-11 7.34494E-11 6.77006E-11 6.22053E-11 5.69624E-11 5.19705E-11 4.72283E-11 4.27342E-11 3.84866E-11 3.44837E-11 3.07233E-11 2.72035E-11);
			K2 (1.45136E-10 1.36753E-10 1.28682E-10 1.20872E-10 1.13322E-10 1.06032E-10 9.90005E-11 9.22275E-11 8.57119E-11 7.94528E-11 7.34494E-11 6.77006E-11 6.22053E-11 5.69624E-11 5.19705E-11 4.72283E-11 4.27342E-11 3.84866E-11 3.44837E-11 3.07233E-11 2.72035E-11);
			K3 (1.45136E-10 1.36753E-10 1.28682E-10 1.20872E-10 1.13322E-10 1.06032E-10 9.90005E-11 9.22275E-11 8.57119E-11 7.94528E-11 7.34494E-11 6.77006E-11 6.22053E-11 5.69624E-11 5.19705E-11 4.72283E-11 4.27342E-11 3.84866E-11 3.44837E-11 3.07233E-11 2.72035E-11);
			}

		//SMiLE Zoltek UD 300 mit Binder
//		MeasuredData
//		{
			//type: exponential, linear, spline
//			type spline;
//			FVG (0.333 0.375 0.4166 0.458 0.5);			
//			K1 (9.91225e-9 6.33897e-9 1.49715e-10 5.554932e-11 2.66580e-11);
//			K2 (2.29430e-10 7.53798e-11 2.97760e-11 1.30688e-11 3.81960e-12);
//			K3 (2.29430e-10 7.53798e-11 2.97760e-11 1.30688e-11 3.81960e-12);
//		}

		//SMiLE Formax Biax 300 Iso
//		MeasuredData
//		{
			//type: exponential, linear, spline
//			type spline;
//			FVG (0.333 0.375 0.4166 0.458 0.5 0.542 0.583);			
//			K1 (1.9596e-9 6.41286e-11 4.92349e-11 2.24302e-11 8.07899e-12 6.94560e-12);
//			K2 (1.9596e-9 6.41286e-11 4.92349e-11 2.24302e-11 8.07899e-12 6.94560e-12);
//			K3 (1.9596e-9 6.41286e-11 4.92349e-11 2.24302e-11 8.07899e-12 6.94560e-12);
//		}
	
		//SMiLE Formax Triax 450 Iso
//		MeasuredData
//		{	
//			//type: exponential, linear, spline
//			type spline;
//			FVG (0.375 0.43 0.5 0.56 0.62);			
//			K1 (1.61403e-10 6.52181e-11 2.21309e-11 4.46229e-12 3.24802e-12);
//			K2 (1.61403e-10 6.52181e-11 2.21309e-11 4.46229e-12 3.24802e-12);
//			K3 (1.61403e-10 6.52181e-11 2.21309e-11 4.46229e-12 3.24802e-12);
//		}		
    }
	
	
	/*
	layer2
	{
	useLocalFiberVolumeFraction true;
	useGebart true;
	
	fiberVolFraction 0.55;
    fiberAngle      0;
	vf0	0.55;
	vfmax	0.907; // Hexagonal packaging
	
        Darcy
        {
            d  d [ 0 -2 0 0 0 0 0 ] (3.676e10 1.5625e11 1.5625e11);
            f  f [ 0 -1 0 0 0 0 0 ] (0 0 0);
        }
    }
	*/
)


// ************************************************************************* //
