tutorials/OF-RTM/Bruschke/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[1 -1 -2 0 0 0 0];

internalField	uniform 1e5;


boundaryField
{
	inlet
	{
		type	        	totalPressure;
		p0              	uniform 2e5;
		U               	U;
		phi             	phi;
		rho             	rho;
		psi             	none;
		gamma           	1;
		value           	uniform 0;
	}

	
	outlet
	{
		type	        	totalPressure;
		p0              	uniform 1e5;
		U               	U;
		phi             	phi;
		rho             	rho;
		psi             	none;
		gamma           	1;
		value           	uniform 0;
	}
	    

        walls
        {
            type            fixedFluxPressure;
            adjoint         no;
        }
	
	upperWall
        {
            type            fixedFluxPressure;
        }
        
        lowerWall
        {
            type            fixedFluxPressure;
        }
	    
}


// ************************************************************************* //
